app/views/orders/index.html.erb

    <td><%= order.id %></td>
    <td><%= order.order_number %></td>
---
SELECT `orders`.* FROM `orders`