app/views/products/_form.html.erb

SELECT `categories`.* FROM `categories`
---
    <%= f.label :category %><br />
    <%= collection_select(:product, :category_id, Category.all , :id, :name, {:prompt => true})  %>